import React, { Component } from 'react'
import { Container, Media } from 'react-bootstrap'

export default class AboutSite extends Component{
    render(){
        return(
            <Container fluid>
                <h2 className = 'text-center m-3'>Статистичний портал огляду військового балансу в світі</h2>
                <h5>Декілька слів про структуру :</h5>
                <p style = {{textIndent: '20px'}}>Портал огляду військового балансу в світі є дуже важливим і висвітлює усі сучасні новини сьогодення, можливо і не всі, але я вирішила за це не нагадувати.</p>
                <p style = {{textIndent: '20px'}}>Активні читачі сайту беруть активну участь в обговоренні, коментуванні новин, проблем та всього, що оточує.
                Є можливість розвинути полеміку, але чи варто...?</p>
                <h5>Обдарований (ні) розробник сайту:</h5>
                <Media className = 'm-4'>
                    <img src = 'https://scontent.flwo2-1.fna.fbcdn.net/v/t39.30808-6/p720x720/240967328_1202851163548542_2646812890527851679_n.jpg?_nc_cat=103&ccb=1-5&_nc_sid=730e14&_nc_ohc=WLtwFuNfTGgAX9_ITgg&_nc_ht=scontent.flwo2-1.fna&oh=279e9fbd7cfebcadb8335ba1aec75d4e&oe=61AF2BA2' width="150" height="150" alt = 'Даринка-програміст'/>
                    <Media.Body className = 'mt-5'>
                        <h6 className = 'ml-3'>майбутній головнокомандувач всія Русі Даринка</h6>
                        <p className = 'ml-3 font-italic'>геніальний курсант, активіст, ні разу не програміст, але інколи старається,
                            у вільний від навчання час надає перевагу розвитку у всіх сферах, котрі ніяким чином не пов'язані з основною діяльністю.
                        Спортсменка(ні), позитивна жінка-військовослужбовець, феміністка(?), виховала за свої аж 20 років дітей стільки, що можна продавати книжки "Як я їх не вбила за всі ці роки"
                        </p>
                    </Media.Body>
                </Media>
            </Container>
        )
    }
}